#include <iostream>
#include <limits.h>

// x - y를 했을 때 오버플로우를 판별하는 함수
// 오버플로우가 발생하지 않으면 1을 반환
int tsub_ok(int x, int y){
    int s = x - y;

    int mask = INT_MIN; // 1000...0000

    return !(((x ^ y) & mask) && ((x ^ s) & mask));
}

// x - y가 오버플로우가 발생하려면

// 1. x = 음수, y = 양수일 때 x - y가 TMin 미만
// 2. x = 양수, y = 음수일 때 x - y가 TMax 이상

// 결론적으로, 부호가 다르고 절댓값 씌워서 더했을 때..
// 이건 아닌 듯..

// 일단 positive든 negative든 오버플로우가 발생할 수 있음.

// 값의 관점에서는, 음수 - 양수 = 양수 / 양수 - 음수 = 음수
// 이런 비정상적인 값이 나와야 하는데,
// 어차피 x - y + y == x같은건 mod 2^w 때문에 안통함.

// 이거 부호를 판별할 수 있는 그런게..
// 최상위 비트를 보면 되지 않을까?
// 근데 이게 세 개가 동시에 얽혀있음. x / y / x - y 이렇게.
// 이건 사실상 if문이 필요하지 않을까?
// 모르겠당..

// 결국 모든 경우에 통하도록 일반화해보면 음수 - 양수 = 양수인 경우 / 양수 - 음수 = 음수인 경우
// 이렇게 두 경우에는 오버플로우란말이야?
// 근데 이걸 부호를 안보고 뭘 할 수가 있나? 생각해보면..

// 딱 x - y만 보고 알 수 있는건 솔직히 부호밖에 없지 않을까?
// 일단 무조건 x - y임. y - x는 고려 안함.
// 시발 힌트 있었으면 좋겠다..

// 이거 일단 이렇게 생각하는게 맞나? 부호로..
// 근데 이거 그냥 ㅈ병신같이 풀어버리고싶다 진짜..
// int64같은 자료형 써서ㅋㅋ

// 여기까진 내가 직접 적음

// (구현 아이디어)
// 1. x ^ y를 했을 때 최상위 비트가 1이 찍혀나옴.
// 2. x ^ (x - y)를 했을 때 최상위 비트가 1이 찍혀나옴.

// 이 두 가지만 보면 ㅇㅋ지?

// 딱 부호비트만 1인 INT_MIN 상수로 마스킹을 해서,
// 부호비트만 쏙 골라내기.
// 어차피 C언어에서는 0 아니면 무조건 true잖아?